tap "hashicorp/tap"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"

# Terminal
brew "bash-completion"
brew "tmux"
brew "gnupg"
brew "fzf"
brew "zoxide"
brew "bat"
brew "gh"

# Cloud & infrastructure
brew "azure-cli"
brew "awscli"
brew "helm"
brew "kubectl"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "terragrunt"
brew "k9s"
brew "kubectx"
brew "sops"
brew "tflint"
brew "infracost"

# Data
brew "jq"
brew "yq"
brew "duckdb"
brew "libpq"
brew "msodbcsql18"
brew "mssql-tools18"

# Development
brew "pre-commit"
brew "git-delta"
brew "mise"

# Apps
cask "claude-code"
