tap "hashicorp/tap"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"

# Terminal
brew "bash-completion"
brew "tmux"
brew "gnupg"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "bat"
brew "gh"

# Cloud & infrastructure
brew "azure-cli"
brew "awscli"
brew "helm"
brew "kubectl"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "terragrunt"
brew "k9s"
brew "kubectx"
brew "sops"
brew "tflint"
brew "infracost"
brew "direnv"
brew "trivy"
brew "checkov"

# Data
brew "jq"
brew "yq"
brew "duckdb"
brew "libpq"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"

# Development
brew "pre-commit"
brew "git-delta"
brew "mise"
brew "typst"
brew "shellcheck"
brew "starship"

# Fonts
cask "font-jetbrains-mono"

# Apps
cask "claude-code"
cask "visual-studio-code"
