tap "hashicorp/tap"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"

# Terminal
brew "bash-completion"
brew "tmux"
brew "gnupg"

# Cloud & infrastructure
brew "azure-cli"
brew "awscli"
brew "helm"
brew "kubectl"
brew "hashicorp/tap/terraform"
brew "terragrunt"

# Data
brew "jq"
brew "libpq"
brew "msodbcsql18"
brew "mssql-tools18"

# Fonts
cask "font-hack-nerd-font"
cask "font-droid-sans-mono-nerd-font"

# Apps
cask "claude-code"
