# Infrastructure & Cloud
hashicorp.terraform
ms-vscode.azurecli
amazonwebservices.aws-toolkit-vscode
ms-kubernetes-tools.vscode-kubernetes-tools
ms-azuretools.vscode-docker

# Data
cweijan.vscode-database-client2

# Languages & Formatting
redhat.vscode-yaml
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff
tamasfe.even-better-toml
golang.go

# AI
anthropic.claude-code
github.copilot
github.copilot-chat

# Git
eamodio.gitlens
github.vscode-pull-request-and-issues
github.vscode-github-actions

# Theme
pkief.material-icon-theme

# Remote
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-containers

# Utilities
esbenp.prettier-vscode
streetsidesoftware.code-spell-checker
usernamehw.errorlens
editorconfig.editorconfig
ms-vscode.makefile-tools
github.remotehub
